In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df1 = pd.read_csv('loan_data.csv')

In [3]:
df1[:10]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
5,LP001011,Male,Yes,2,Graduate,Yes,5417,4196.0,267.0,360.0,1.0,Urban,Y
6,LP001013,Male,Yes,0,Not Graduate,No,2333,1516.0,95.0,360.0,1.0,Urban,Y
7,LP001014,Male,Yes,3+,Graduate,No,3036,2504.0,158.0,360.0,0.0,Semiurban,N
8,LP001018,Male,Yes,2,Graduate,No,4006,1526.0,168.0,360.0,1.0,Urban,Y
9,LP001020,Male,Yes,1,Graduate,No,12841,10968.0,349.0,360.0,1.0,Semiurban,N

In [4]:
df1.shape

(614, 13)

In [5]:
df1

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [6]:
df = df1.drop(columns='Loan_ID')

In [7]:
df

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...
609,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [8]:
pd.options.display.max_rows=None

In [9]:
df[:5]

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [10]:
df.isnull().sum()

Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

# 1. Display Top 5 Rows of The Dataset

In [11]:
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

# 2. Check Last 5 Rows of The Dataset

In [12]:
df.tail()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
609,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

# 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)

In [13]:
df.shape

(614, 12)

In [14]:
print('number of rows = ',df.shape[0])
print('number of columns =', df.shape[1])

number of rows =  614
number of columns = 12

# 4. Get Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             601 non-null    object
 1   Married            611 non-null    object
 2   Dependents         599 non-null    object
 3   Education          614 non-null    object
 4   Self_Employed      582 non-null    object
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         592 non-null    float64
 8   Loan_Amount_Term   600 non-null    float64
 9   Credit_History     564 non-null    float64
 10  Property_Area      614 non-null    object
 11  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(7)
memory usage: 57.7+ KB

# 5. Check Null Values In The Dataset

In [16]:
df.isnull().sum()

Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [17]:
(df.isnull().sum()/df.shape[0])*100

Gender               2.117264
Married              0.488599
Dependents           2.442997
Education            0.000000
Self_Employed        5.211726
ApplicantIncome      0.000000
CoapplicantIncome    0.000000
LoanAmount           3.583062
Loan_Amount_Term     2.280130
Credit_History       8.143322
Property_Area        0.000000
Loan_Status          0.000000
dtype: float64

# 6. Handling The missing Values

In [18]:
column = ['Married','Dependents','LoanAmount','Loan_Amount_Term']

In [19]:
df = df.dropna(subset=column)

In [20]:
df.isnull().sum()

Gender               13
Married               0
Dependents            0
Education             0
Self_Employed        30
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Credit_History       49
Property_Area         0
Loan_Status           0
dtype: int64

In [21]:
df['Self_Employed'].value_counts()

No     460
Yes     76
Name: Self_Employed, dtype: int64

In [22]:
df['Self_Employed'].mode()

0    No
Name: Self_Employed, dtype: object

In [23]:
df['Self_Employed']= df['Self_Employed'].fillna(df['Self_Employed'].mode()[0])

C:\Users\PRANJAL SAXENA\AppData\Local\Temp\ipykernel_16332\1659637598.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Self_Employed']= df['Self_Employed'].fillna(df['Self_Employed'].mode()[0])

In [24]:
df.isnull().sum()

Gender               13
Married               0
Dependents            0
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Credit_History       49
Property_Area         0
Loan_Status           0
dtype: int64

In [25]:
df['Gender'].value_counts()

Male      449
Female    104
Name: Gender, dtype: int64

In [26]:
df['Gender'].mode()

0    Male
Name: Gender, dtype: object

In [27]:
df['Gender'] = df['Gender'].fillna(df['Gender'].mode()[0])

C:\Users\PRANJAL SAXENA\AppData\Local\Temp\ipykernel_16332\524126155.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Gender'] = df['Gender'].fillna(df['Gender'].mode()[0])

In [28]:
df.isnull().sum()

Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Credit_History       49
Property_Area         0
Loan_Status           0
dtype: int64

In [29]:
df['Credit_History'].value_counts()

1.0    443
0.0     74
Name: Credit_History, dtype: int64

In [30]:
df['Credit_History'].mode()

0    1.0
Name: Credit_History, dtype: float64

In [31]:
df['Credit_History'] = df['Credit_History'].fillna(df['Credit_History'].mode()[0])

C:\Users\PRANJAL SAXENA\AppData\Local\Temp\ipykernel_16332\1589981221.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Credit_History'] = df['Credit_History'].fillna(df['Credit_History'].mode()[0])

In [32]:
df.isnull().sum()

Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

# 7. Handling Categorical Columns

In [33]:
df[:4]

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [34]:
df['Dependents'].value_counts()

0     323
2      98
1      97
3+     48
Name: Dependents, dtype: int64

In [35]:
df['Dependents'] = df['Dependents'].replace(to_replace = '3+', value = '4')

C:\Users\PRANJAL SAXENA\AppData\Local\Temp\ipykernel_16332\1831677437.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Dependents'] = df['Dependents'].replace(to_replace = '3+', value = '4')

In [36]:
df['Dependents'].unique()

array(['1', '0', '2', '4'], dtype=object)

In [37]:
df[:3]
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [38]:
df['Gender'].value_counts()

Male      462
Female    104
Name: Gender, dtype: int64

In [39]:
df['Gender'] = df['Gender'].map({'Male':'1', 'Female':'0'}).astype('int')

C:\Users\PRANJAL SAXENA\AppData\Local\Temp\ipykernel_16332\2368163124.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Gender'] = df['Gender'].map({'Male':'1', 'Female':'0'}).astype('int')

In [40]:
df['Gender'].value_counts()

1    462
0    104
Name: Gender, dtype: int64

In [41]:
df['Married'] = df['Married'].map({'Yes':'1', 'No':'0'}).astype('int32')

C:\Users\PRANJAL SAXENA\AppData\Local\Temp\ipykernel_16332\118048065.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Married'] = df['Married'].map({'Yes':'1', 'No':'0'}).astype('int32')

In [42]:
df['Married'].unique()

array([1, 0])

In [43]:
df[:5]

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,1,1,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,1,1,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,1,1,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,1,0,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
5,1,1,2,Graduate,Yes,5417,4196.0,267.0,360.0,1.0,Urban,Y

In [44]:
df['Education'].value_counts()

Graduate        449
Not Graduate    117
Name: Education, dtype: int64

In [45]:
df['Education'] = df['Education'].map({'Graduate':'1','Not Graduate':0 }).astype('int')

C:\Users\PRANJAL SAXENA\AppData\Local\Temp\ipykernel_16332\932929749.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Education'] = df['Education'].map({'Graduate':'1','Not Graduate':0 }).astype('int')

In [46]:
df['Education'].unique()

array([1, 0])

In [47]:
df[:4]

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,1,1,1,1,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,1,1,0,1,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,1,1,0,0,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,1,0,0,1,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [48]:
df['Self_Employed'].value_counts()

No     490
Yes     76
Name: Self_Employed, dtype: int64

In [49]:
df['Self_Employed'] = df['Self_Employed'].map({'Yes':'1','No':0}).astype('int')

C:\Users\PRANJAL SAXENA\AppData\Local\Temp\ipykernel_16332\3634773903.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Self_Employed'] = df['Self_Employed'].map({'Yes':'1','No':0}).astype('int')

In [50]:
df['Self_Employed'].unique()

array([0, 1])

In [51]:
df[:4]

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,1,1,1,1,0,4583,1508.0,128.0,360.0,1.0,Rural,N
2,1,1,0,1,1,3000,0.0,66.0,360.0,1.0,Urban,Y
3,1,1,0,0,0,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,1,0,0,1,0,6000,0.0,141.0,360.0,1.0,Urban,Y

In [52]:
df['Property_Area'].value_counts()

Semiurban    221
Urban        178
Rural        167
Name: Property_Area, dtype: int64

In [53]:
df['Property_Area'] = df['Property_Area'].map({'Rural':'0','Urban':'1','Semiurban':'2'}).astype('int')

C:\Users\PRANJAL SAXENA\AppData\Local\Temp\ipykernel_16332\485558992.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Property_Area'] = df['Property_Area'].map({'Rural':'0','Urban':'1','Semiurban':'2'}).astype('int')

In [54]:
df['Property_Area'].unique()

array([0, 1, 2])

In [55]:
df[:5]

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,1,1,1,1,0,4583,1508.0,128.0,360.0,1.0,0,N
2,1,1,0,1,1,3000,0.0,66.0,360.0,1.0,1,Y
3,1,1,0,0,0,2583,2358.0,120.0,360.0,1.0,1,Y
4,1,0,0,1,0,6000,0.0,141.0,360.0,1.0,1,Y
5,1,1,2,1,1,5417,4196.0,267.0,360.0,1.0,1,Y

In [56]:
df['Loan_Status'].unique()

array(['N', 'Y'], dtype=object)

In [57]:
df['Loan_Status'] = df['Loan_Status'].map({'N':'0','Y':'1'}).astype('int')

C:\Users\PRANJAL SAXENA\AppData\Local\Temp\ipykernel_16332\1055388061.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Loan_Status'] = df['Loan_Status'].map({'N':'0','Y':'1'}).astype('int')

In [58]:
df['Dependents'] =df['Dependents'].astype('int')

C:\Users\PRANJAL SAXENA\AppData\Local\Temp\ipykernel_16332\2487625046.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Dependents'] =df['Dependents'].astype('int')

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 566 entries, 1 to 613
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             566 non-null    int32
 1   Married            566 non-null    int32
 2   Dependents         566 non-null    int32
 3   Education          566 non-null    int32
 4   Self_Employed      566 non-null    int32
 5   ApplicantIncome    566 non-null    int64
 6   CoapplicantIncome  566 non-null    float64
 7   LoanAmount         566 non-null    float64
 8   Loan_Amount_Term   566 non-null    float64
 9   Credit_History     566 non-null    float64
 10  Property_Area      566 non-null    int32
 11  Loan_Status        566 non-null    int32
dtypes: float64(4), int32(7), int64(1)
memory usage: 42.0 KB

# SCALING OF DATA

In [60]:
# col = ['CoapplicantIncome','LoanAmount','Loan_Amount_Term','Credit_History']
# from sklearn.preprocessing import StandardScaler
# ss = StandardScaler()
# df = ss.fit_transform(col)

# 8. Store Feature Matrix In X And Response (Target) In Vector y

In [61]:
df.columns

Index(['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
       'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [62]:
X = df.drop(columns='Loan_Status')
y = df['Loan_Status']

# 9. Feature Scaling

In [63]:
col = ['CoapplicantIncome','LoanAmount','Loan_Amount_Term','Credit_History']

from sklearn.preprocessing import StandardScaler
ss = StandardScaler()
X[col] = ss.fit_transform(X[col])

In [66]:
X[:5]

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
1,1,1,1,1,0,4583,-0.048630,-0.223348,0.28141,0.387823,0
2,1,1,0,1,1,3000,-0.548604,-0.935741,0.28141,0.387823,1
3,1,1,0,0,0,2583,0.233185,-0.315270,0.28141,0.387823,1
4,1,0,0,1,0,6000,-0.548604,-0.073976,0.28141,0.387823,1
5,1,1,2,1,1,5417,0.842569,1.373790,0.28141,0.387823,1

In [67]:
X.shape

(566, 11)

# 10. Splitting The Dataset Into The Training Set And Test Set & Applying K-Fold Cross Validation

In [83]:
from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score
from sklearn.metrics import accuracy_score
import numpy as np
from sklearn.metrics import accuracy_score,precision_score,classification_report,f1_score,r2_score

In [79]:
X_train,X_test, y_train,y_test = train_test_split(X,y, test_size=0.2, random_state=42)
X_train.shape[0],X_test.shape[0],y_train.shape[0],y_test.shape[0]

(452, 114, 452, 114)

In [93]:
# model_df ={}
# def model_val(model,X,y):
#     X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=42)
#     model.fit(X_train,y_train)
#     y_pred = model.predict(X_test)
    
    
    
    
model_df={}
def model_val(model,X,y):
    X_train,X_test,y_train,y_test=train_test_split(X,y,
                                                   test_size=0.20,
                                                   random_state=42)
    model.fit(X_train,y_train)
    y_pred=model.predict(X_test)
    print(f"{model} accuracy is {accuracy_score(y_test,y_pred)}")
    
    score = cross_val_score(model,X,y,cv=5)
    print(f"{model} Avg cross val score is {np.mean(score)}")
    model_df[model]=round(np.mean(score)*100,2)

In [73]:
# model_df

{LogisticRegression(): 80.74, LogisticRegression(): 80.74}

# 11. Logistic Regression

In [95]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()
model_val(model,X,y)

LogisticRegression() accuracy is 0.7631578947368421

C:\Users\PRANJAL SAXENA\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression() Avg cross val score is 0.807421207886974

In [81]:
pred1 = lr.predict(X_test)

In [82]:
lr.score(X_test,y_test)

0.7631578947368421

In [84]:
accuracy_score(y_test,pred1)

0.7631578947368421

In [85]:
r2_score(y_test,pred1)

-0.11320072332730535

In [90]:
precision_score(y_test,pred1)

0.7452830188679245

In [92]:
cr = classification_report(y_test,pred1)
print(cr)

              precision    recall  f1-score   support

           0       1.00      0.23      0.37        35
           1       0.75      1.00      0.85        79

    accuracy                           0.76       114
   macro avg       0.87      0.61      0.61       114
weighted avg       0.82      0.76      0.71       114

In [96]:
from sklearn.model_selection import RandomizedSearchCV
rv = RandomizedSearchCV()

TypeError: __init__() missing 2 required positional arguments: 'estimator' and 'param_distributions'